app/controllers/top_controller.rb

SELECT `products`.* FROM `products` ORDER BY id DESC LIMIT 20
---
  def index
    @products = Product.all.limit(20).order('id ASC')

SELECT `products`.* FROM `products` WHERE (title Like('%params[keyword]%'))
---
  def search
    @products = Product.where('title Like(?)', "%#{params[:keyword]}%")

SELECT `products`.* FROM `products` WHERE `products`.`id` = 100 LIMIT 1
---
  def entry
    @product = Product.find(params[:id])

INSERT INTO `reviews` (`created_at`, `nickname`, `product_id`, `rate`, `review`, `updated_at`) VALUES ('2015-09-24 02:34:11', 'yasu', 66, 4, 'wwwwwwwwwwwwwwwwww\r\n', '2015-09-24 02:34:11')
---
  def post
    Review.create(nickname:current_user.nickname, product_id:params[:id], rate:create_params[:rate], review:create_params[:review])